{
  "common": {
    "name": "al-ko",
    "version": "0.2.12",
    "tier": 3,
    "titleLang": {
      "en": "AL-KO",
      "de": "AL-KO",
      "ru": "AL-KO",
      "pt": "AL-KO",
      "nl": "AL-KO",
      "fr": "AL-KO",
      "it": "AL-KO",
      "es": "AL-KO",
      "pl": "AL-KO",
      "uk": "AL-KO",
      "zh-cn": "AL-KO"
    },
    "desc": {
      "en": "Adapter for AL-KO Robolinho lawnmowers",
      "de": "Adapter für AL-KO Robolinho Rasenmäher",
      "ru": "Адаптер для газонокосилок AL-KO Robolinho",
      "pt": "Adaptador para cortadores de grama AL-KO Robolinho",
      "nl": "Adapter voor AL-KO Robolinho grasmaaiers",
      "fr": "Adaptateur pour tondeuses AL-KO Robolinho",
      "it": "Adattatore per tosaerba AL-KO Robolinho",
      "es": "Adaptador para cortacéspedes AL-KO Robolinho",
      "pl": "Adapter do kosiarek AL-KO Robolinho",
      "uk": "Адаптер для газонокосарок AL-KO Robolinho",
      "zh-cn": "AL-KO Robolinho 割草机适配器"
    },
    "authors": [
      "Hubert Zechner <hubertiob@posteo.at>"
    ],
    "news": {
      "0.2.12": {
        "en": "Admin UI: fixed schema URL to official jsonConfig schema and added missing responsive size attributes. Raised minimum requirements: js-controller >= 6.0.11, admin >= 7.6.17. No functional changes.",
        "de": "Admin-UI: Offizielle jsonConfig-Schema-URL korrigiert und fehlende responsive Size-Attribute ergänzt. Mindestanforderungen erhöht: js-controller >= 6.0.11, admin >= 7.6.17. Keine funktionalen Änderungen.",
        "ru": "Admin UI: исправлена ссылка на официальную схему jsonConfig и добавлены недостающие атрибуты размера. Минимальные требования повышены: js-controller >= 6.0.11, admin >= 7.6.17. Функциональных изменений нет.",
        "pt": "Admin UI: corrigida a URL do schema oficial do jsonConfig e adicionados os atributos de tamanho responsivo em falta. Requisitos mínimos aumentados: js-controller >= 6.0.11, admin >= 7.6.17. Sem alterações funcionais.",
        "nl": "Admin UI: officiële jsonConfig-schema-URL gecorrigeerd en ontbrekende responsieve grootte-attributen toegevoegd. Minimumeisen verhoogd: js-controller >= 6.0.11, admin >= 7.6.17. Geen functionele wijzigingen.",
        "fr": "Admin UI : URL du schéma jsonConfig officielle corrigée et ajout des attributs de taille responsives manquants. Exigences minimales relevées : js-controller >= 6.0.11, admin >= 7.6.17. Pas de changement fonctionnel.",
        "it": "Admin UI: corretta la URL dello schema jsonConfig ufficiale e aggiunti gli attributi di dimensione responsive mancanti. Requisiti minimi aumentati: js-controller >= 6.0.11, admin >= 7.6.17. Nessuna modifica funzionale.",
        "es": "Admin UI: corregida la URL del esquema jsonConfig oficial y añadidos los atributos de tamaño responsivo que faltaban. Requisitos mínimos elevados: js-controller >= 6.0.11, admin >= 7.6.17. Sin cambios funcionales.",
        "pl": "Admin UI: poprawiono adres URL oficjalnego schematu jsonConfig i dodano brakujące responsywne atrybuty rozmiaru. Podniesiono minimalne wymagania: js-controller >= 6.0.11, admin >= 7.6.17. Brak zmian funkcjonalnych.",
        "uk": "Admin UI: виправлено URL офіційної схеми jsonConfig і додано відсутні адаптивні атрибути розміру. Підвищено мінімальні вимоги: js-controller >= 6.0.11, admin >= 7.6.17. Без функціональних змін.",
        "zh-cn": "Admin UI：修正为官方 jsonConfig 架构 URL，并补全缺失的响应式尺寸属性。提高最低要求：js-controller >= 6.0.11，admin >= 7.6.17。无功能性变更。"
      },
      "0.2.11": {
        "en": "Minor code corrections and optimizations. No functional changes – improved stability and maintainability.",
        "de": "Kleinere Code-Korrekturen und Optimierungen vorgenommen. Keine funktionalen Änderungen – Stabilität und Wartbarkeit verbessert.",
        "ru": "Небольшие исправления и оптимизация кода. Без функциональных изменений – повышена стабильность и поддерживаемость.",
        "pt": "Pequenas correções e otimizações no código. Sem alterações funcionais – estabilidade e manutenção aprimoradas.",
        "nl": "Kleine codecorrecties en optimalisaties. Geen functionele wijzigingen – verbeterde stabiliteit en onderhoudbaarheid.",
        "fr": "Petites corrections et optimisations du code. Aucune modification fonctionnelle – stabilité et maintenabilité améliorées.",
        "it": "Correzioni e ottimizzazioni minori del codice. Nessuna modifica funzionale – migliorata stabilità e manutenibilità.",
        "es": "Pequeñas correcciones y optimizaciones de código. Sin cambios funcionales – mayor estabilidad y mantenibilidad.",
        "pl": "Drobne poprawki i optymalizacje kodu. Brak zmian funkcjonalnych – poprawiona stabilność i łatwość utrzymania.",
        "uk": "Невеликі виправлення та оптимізації коду. Без функціональних змін – покращено стабільність і підтримуваність.",
        "zh-cn": "进行了小的代码修正和优化。无功能性更改——提高了稳定性和可维护性。"
      },
      "0.2.10": {
        "en": "Adapter category updated: changed type from 'hardware' to 'garden' for correct classification in ioBroker Admin and repositories. No functional changes.",
        "de": "Adapter-Kategorie aktualisiert: Typ von 'hardware' auf 'garden' geändert, um die korrekte Einordnung in ioBroker Admin und den Repositories sicherzustellen. Keine funktionalen Änderungen.",
        "ru": "Обновлена категория адаптера: тип изменён с 'hardware' на 'garden' для правильной классификации в ioBroker Admin и репозиториях. Без функциональных изменений.",
        "pt": "Categoria do adaptador atualizada: tipo alterado de 'hardware' para 'garden' para classificação correta no ioBroker Admin e repositórios. Sem alterações funcionais.",
        "nl": "Adaptercategorie bijgewerkt: type gewijzigd van 'hardware' naar 'garden' voor correcte classificatie in ioBroker Admin en repositories. Geen functionele wijzigingen.",
        "fr": "Catégorie d’adaptateur mise à jour : type modifié de 'hardware' à 'garden' pour une classification correcte dans ioBroker Admin et les dépôts. Aucune modification fonctionnelle.",
        "it": "Categoria dell’adattatore aggiornata: tipo modificato da 'hardware' a 'garden' per una corretta classificazione in ioBroker Admin e nei repository. Nessuna modifica funzionale.",
        "es": "Categoría del adaptador actualizada: tipo cambiado de 'hardware' a 'garden' para una clasificación correcta en ioBroker Admin y los repositorios. Sin cambios funcionales.",
        "pl": "Zaktualizowano kategorię adaptera: zmieniono typ z 'hardware' na 'garden' w celu poprawnej klasyfikacji w ioBroker Admin i repozytoriach. Bez zmian funkcjonalnych.",
        "uk": "Оновлено категорію адаптера: тип змінено з 'hardware' на 'garden' для правильного відображення в ioBroker Admin і репозиторіях. Без функціональних змін.",
        "zh-cn": "更新适配器类别：将类型从“hardware”更改为“garden”，以便在 ioBroker Admin 和存储库中正确分类。无功能更改。"
      },
      "0.2.9": {
        "en": "Maintenance update: resolved npm dependency conflicts (`sinon-chai` vs `chai`), updated ESLint configuration to version 9 with @iobroker/eslint-config v2.2.0 for full compatibility. Improved CI stability on GitHub Actions. No functional changes.",
        "de": "Wartungsupdate: npm-Abhängigkeitskonflikte (`sinon-chai` vs. `chai`) behoben, ESLint-Konfiguration auf Version 9 mit @iobroker/eslint-config v2.2.0 aktualisiert. Verbesserte CI-Stabilität auf GitHub Actions. Keine funktionalen Änderungen.",
        "ru": "Обновление обслуживания: устранены конфликты зависимостей npm (`sinon-chai` против `chai`), обновлена конфигурация ESLint до версии 9 с @iobroker/eslint-config v2.2.0. Улучшена стабильность CI в GitHub Actions. Без функциональных изменений.",
        "pt": "Atualização de manutenção: resolvidos conflitos de dependência npm (`sinon-chai` vs `chai`), configuração do ESLint atualizada para a versão 9 com @iobroker/eslint-config v2.2.0. Estabilidade do CI aprimorada no GitHub Actions. Sem alterações funcionais.",
        "nl": "Onderhoudsupdate: npm-afhankelijkheidsconflicten (`sinon-chai` vs `chai`) opgelost, ESLint-configuratie bijgewerkt naar versie 9 met @iobroker/eslint-config v2.2.0. Verbeterde CI-stabiliteit op GitHub Actions. Geen functionele wijzigingen.",
        "fr": "Mise à jour de maintenance : résolution des conflits de dépendances npm (`sinon-chai` vs `chai`), configuration ESLint mise à jour vers la version 9 avec @iobroker/eslint-config v2.2.0. Stabilité CI améliorée sur GitHub Actions. Aucune modification fonctionnelle.",
        "it": "Aggiornamento di manutenzione: risolti i conflitti di dipendenza npm (`sinon-chai` vs `chai`), aggiornata la configurazione ESLint alla versione 9 con @iobroker/eslint-config v2.2.0. Migliorata la stabilità del CI su GitHub Actions. Nessuna modifica funzionale.",
        "es": "Actualización de mantenimiento: resueltos los conflictos de dependencias npm (`sinon-chai` vs `chai`), configuración de ESLint actualizada a la versión 9 con @iobroker/eslint-config v2.2.0. Estabilidad de CI mejorada en GitHub Actions. Sin cambios funcionales.",
        "pl": "Aktualizacja konserwacyjna: rozwiązano konflikty zależności npm (`sinon-chai` vs `chai`), zaktualizowano konfigurację ESLint do wersji 9 z @iobroker/eslint-config v2.2.0. Poprawiono stabilność CI w GitHub Actions. Brak zmian funkcjonalnych.",
        "uk": "Технічне оновлення: усунуто конфлікти залежностей npm (`sinon-chai` проти `chai`), оновлено конфігурацію ESLint до версії 9 із @iobroker/eslint-config v2.2.0. Покращено стабільність CI у GitHub Actions. Без функціональних змін.",
        "zh-cn": "维护更新：解决 npm 依赖冲突（`sinon-chai` 与 `chai`），将 ESLint 配置更新到版本 9 并使用 @iobroker/eslint-config v2.2.0。改进了 GitHub Actions 上的 CI 稳定性。无功能更改。"
      },
      "0.2.8": {
        "en": "Replaced external icon with optimized 128×128 version for correct npm and ioBroker Admin display. Fixed repository path (master branch) for proper package resolution. No functional changes.",
        "de": "Externes Icon durch optimierte 128×128-Version ersetzt, um die Anzeige in npm und ioBroker Admin zu korrigieren. Repository-Pfad (master-Branch) für korrekte Paketauflösung angepasst. Keine funktionalen Änderungen.",
        "ru": "Заменён внешний значок на оптимизированную версию 128×128 для правильного отображения в npm и ioBroker Admin. Исправлен путь к репозиторию (ветка master) для корректного определения пакета. Без функциональных изменений.",
        "pt": "Substituído o ícone externo por uma versão otimizada de 128×128 para exibição correta no npm e no ioBroker Admin. Corrigido o caminho do repositório (ramo master) para resolução adequada do pacote. Sem alterações funcionais.",
        "nl": "Extern pictogram vervangen door geoptimaliseerde 128×128-versie voor correcte weergave in npm en ioBroker Admin. Repositorpad (master-branch) gecorrigeerd voor juiste pakketresolutie. Geen functionele wijzigingen.",
        "fr": "Icône externe remplacée par une version optimisée 128×128 pour un affichage correct dans npm et ioBroker Admin. Chemin du dépôt (branche master) corrigé pour une résolution correcte du package. Aucune modification fonctionnelle.",
        "it": "Sostituita l'icona esterna con una versione ottimizzata 128×128 per la corretta visualizzazione in npm e ioBroker Admin. Corretto il percorso del repository (branch master) per una risoluzione corretta del pacchetto. Nessuna modifica funzionale.",
        "es": "Ícono externo reemplazado por una versión optimizada de 128×128 para una visualización correcta en npm y ioBroker Admin. Se corrigió la ruta del repositorio (rama master) para la resolución adecuada del paquete. Sin cambios funcionales.",
        "pl": "Zastąpiono zewnętrzną ikonę zoptymalizowaną wersją 128×128 dla poprawnego wyświetlania w npm i ioBroker Admin. Poprawiono ścieżkę repozytorium (gałąź master) dla właściwego rozwiązania pakietu. Bez zmian funkcjonalnych.",
        "uk": "Зовнішню іконку замінено на оптимізовану версію 128×128 для правильного відображення в npm та ioBroker Admin. Виправлено шлях до репозиторію (гілка master) для коректного визначення пакету. Без функціональних змін.",
        "zh-cn": "将外部图标替换为优化后的 128×128 版本，以便在 npm 和 ioBroker Admin 中正确显示。修复了存储库路径（master 分支），以确保正确解析软件包。无功能更改。"
      },
      "0.2.7": {
        "en": "Adapter-check compliance: made icon references consistent (icon/extIcon now both use al-ko-128.png from GitHub) and ensured image size ≤ 512 px. Removed unnecessary publishConfig from package.json. No functional changes.",
        "de": "Adapter-Check-Konformität: Icon-Verweise vereinheitlicht (icon/extIcon nutzen jetzt beide al-ko-128.png von GitHub) und Bildgröße ≤ 512 px sichergestellt. Unnötiges publishConfig aus package.json entfernt. Keine funktionalen Änderungen.",
        "ru": "Соответствие проверке адаптера: унифицированы ссылки на иконку (icon/extIcon теперь используют al-ko-128.png с GitHub) и обеспечен размер изображения ≤ 512 px. Удалён лишний publishConfig из package.json. Без функциональных изменений.",
        "pt": "Conformidade do adapter-check: referências de ícone unificadas (icon/extIcon agora usam al-ko-128.png do GitHub) e tamanho da imagem ≤ 512 px garantido. Removido publishConfig desnecessário do package.json. Sem alterações funcionais.",
        "nl": "Adapter-check conformiteit: pictogramverwijzingen geharmoniseerd (icon/extIcon gebruiken nu beide al-ko-128.png van GitHub) en beeldgrootte ≤ 512 px geborgd. Onnodige publishConfig uit package.json verwijderd. Geen functionele wijzigingen.",
        "fr": "Conformité au contrôle de l’adaptateur : unification des références d’icône (icon/extIcon utilisent désormais al-ko-128.png depuis GitHub) et taille d’image ≤ 512 px garantie. Suppression de publishConfig inutile dans package.json. Aucun changement fonctionnel.",
        "it": "Conformità all’adapter-check: rese coerenti le referenze dell’icona (icon/extIcon ora usano entrambe al-ko-128.png da GitHub) e garantita dimensione immagine ≤ 512 px. Rimosso publishConfig non necessario da package.json. Nessuna modifica funzionale.",
        "es": "Conformidad con el adapter-check: referencias de icono unificadas (icon/extIcon ahora usan ambos al-ko-128.png desde GitHub) y tamaño de imagen ≤ 512 px garantizado. Eliminado publishConfig innecesario de package.json. Sin cambios funcionales.",
        "pl": "Zgodność z adapter-check: ujednolicono odwołania do ikony (icon/extIcon używają teraz al-ko-128.png z GitHub) i zapewniono rozmiar obrazu ≤ 512 px. Usunięto zbędny publishConfig z package.json. Brak zmian funkcjonalnych.",
        "uk": "Відповідність adapter-check: уніфіковано посилання на значок (icon/extIcon тепер обидва використовують al-ko-128.png з GitHub) і гарантовано розмір зображення ≤ 512 px. Видалено непотрібний publishConfig з package.json. Без функціональних змін.",
        "zh-cn": "通过适配器检查：统一图标引用（icon/extIcon 现均使用 GitHub 上的 al-ko-128.png），并确保图像大小 ≤ 512 像素。移除了 package.json 中不必要的 publishConfig。无功能性变更。"
      },
    },
    "keywords": [
      "al-ko",
      "Robolinho",
      "mower",
      "garden",
      "smart-garden"
    ],
    "extIcon": "https://raw.githubusercontent.com/zechnerhubert/ioBroker.al-ko/master/admin/al-ko-128.png",
    "adminUI": {
      "config": "json"
    },
    "licenseInformation": {
      "type": "free",
      "license": "MIT",
      "link": "https://opensource.org/licenses/MIT"
    },
    "platform": "Javascript/Node.js",
    "type": "garden",
    "loglevel": "info",
    "connectionType": "cloud",
    "dataSource": "push",
    "mode": "daemon",
    "compact": true,
    "icon": "al-ko-128.png",
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "username": "",
    "password": "",
    "clientId": "",
    "clientSecret": "",
    "wsDebug": false
  },
  "protectedNative": [
    "password",
    "clientSecret"
  ],
  "encryptedNative": [
    "password",
    "clientSecret"
  ],
  "objects": [],
  "instanceObjects": []
}
