{
  "common": {
    "name": "al-ko",
    "version": "0.2.1",
    "tier": 3,
    "titleLang": {
      "en": "AL-KO",
      "de": "AL-KO",
      "ru": "AL-KO",
      "pt": "AL-KO",
      "nl": "AL-KO",
      "fr": "AL-KO",
      "it": "AL-KO",
      "es": "AL-KO",
      "pl": "AL-KO",
      "uk": "AL-KO",
      "zh-cn": "AL-KO"
    },
    "desc": {
      "en": "Adapter for AL-KO Robolinho lawnmowers",
      "de": "Adapter für AL-KO Robolinho Rasenmäher",
      "ru": "Адаптер для газонокосилок AL-KO Robolinho",
      "pt": "Adaptador para cortadores de grama AL-KO Robolinho",
      "nl": "Adapter voor AL-KO Robolinho grasmaaiers",
      "fr": "Adaptateur pour tondeuses AL-KO Robolinho",
      "it": "Adattatore per tosaerba AL-KO Robolinho",
      "es": "Adaptador para cortacéspedes AL-KO Robolinho",
      "pl": "Adapter do kosiarek AL-KO Robolinho",
      "uk": "Адаптер для газонокосарок AL-KO Robolinho",
      "zh-cn": "AL-KO Robolinho 割草机适配器"
    },
    "authors": [
      "Hubert Zechner <hubertiob@posteo.at>"
    ],
    "news": {
      "0.2.1": {
        "en": "Added option in Admin UI to enable or disable WebSocket message logging (wsDebug). This allows toggling incoming WebSocket message logs directly in the adapter configuration. Minor internal improvements.",
        "de": "Neue Option in der Admin-UI zum Aktivieren oder Deaktivieren des WebSocket-Nachrichten-Loggings (wsDebug). Das Logging eingehender WebSocket-Nachrichten kann nun direkt in der Adapter-Konfiguration gesteuert werden. Kleine interne Verbesserungen.",
        "ru": "Добавлена опция в интерфейсе администратора для включения или отключения логирования сообщений WebSocket (wsDebug). Теперь можно управлять логированием входящих сообщений WebSocket прямо в настройках адаптера. Незначительные внутренние улучшения.",
        "pt": "Adicionada opção na interface de administração para ativar ou desativar o registro de mensagens WebSocket (wsDebug). Agora é possível alternar o registro de mensagens diretamente na configuração do adaptador. Pequenas melhorias internas.",
        "nl": "Optie toegevoegd in de Admin UI om het loggen van WebSocket-berichten in of uit te schakelen (wsDebug). Hiermee kun je inkomende berichten direct in de adapterconfiguratie beheren. Kleine interne verbeteringen.",
        "fr": "Ajout d'une option dans l'interface d'administration pour activer ou désactiver la journalisation des messages WebSocket (wsDebug). Permet de basculer l'enregistrement des messages directement depuis la configuration de l'adaptateur. Améliorations internes mineures.",
        "it": "Aggiunta un'opzione nell'interfaccia di amministrazione per abilitare o disabilitare il logging dei messaggi WebSocket (wsDebug). Ora è possibile gestire i log direttamente nella configurazione dell'adattatore. Piccoli miglioramenti interni.",
        "es": "Se agregó una opción en la interfaz de administración para habilitar o deshabilitar el registro de mensajes WebSocket (wsDebug). Ahora se puede activar o desactivar directamente desde la configuración del adaptador. Pequeñas mejoras internas.",
        "pl": "Dodano opcję w interfejsie administratora do włączania lub wyłączania logowania wiadomości WebSocket (wsDebug). Można teraz sterować logowaniem bezpośrednio w konfiguracji adaptera. Drobne ulepszenia wewnętrzne.",
        "uk": "Додано опцію в інтерфейсі адміністратора для ввімкнення або вимкнення журналювання повідомлень WebSocket (wsDebug). Тепер можна керувати логуванням безпосередньо в налаштуваннях адаптера. Незначні внутрішні покращення.",
        "zh-cn": "在管理界面中添加了启用或禁用 WebSocket 消息日志记录 (wsDebug) 的选项。现在可以在适配器配置中直接切换日志记录。进行了少量内部改进。"
      },
      "0.2.0": {
        "en": "Migrated to ESLint 9 (Flat-Config) and updated development dependencies",
        "de": "Migration auf ESLint 9 (Flat-Config) und Aktualisierung der Entwicklungsabhängigkeiten",
        "ru": "Переход на ESLint 9 (Flat-Config) и обновлены зависимости для разработки",
        "pt": "Migrado para ESLint 9 (Flat-Config) e dependências de desenvolvimento atualizadas",
        "nl": "Gemigreerd naar ESLint 9 (Flat-Config) en ontwikkelafhankelijkheden bijgewerkt",
        "fr": "Migration vers ESLint 9 (Flat-Config) et mise à jour des dépendances de développement",
        "it": "Migrazione a ESLint 9 (Flat-Config) e aggiornate le dipendenze di sviluppo",
        "es": "Migrado a ESLint 9 (Flat-Config) y actualizadas las dependencias de desarrollo",
        "pl": "Migracja do ESLint 9 (Flat-Config) i aktualizacja zależności deweloperskich",
        "uk": "Міграція на ESLint 9 (Flat-Config) та оновлено залежності розробки",
        "zh-cn": "迁移到 ESLint 9（Flat-Config）并更新开发依赖项"
      },
      "0.1.2": {
        "en": "Improved admin UI config and fixed adapter-check issues",
        "de": "Verbesserte Admin-UI-Konfiguration und behobene Adapter-Check-Fehler",
        "ru": "Улучшена конфигурация админ-интерфейса и исправлены ошибки adapter-check",
        "pt": "Configuração da interface de administração melhorada e problemas do adapter-check corrigidos",
        "nl": "Verbeterde admin UI-configuratie en adapter-checkproblemen opgelost",
        "fr": "Configuration de l'interface d'administration améliorée et correction des problèmes d'adapter-check",
        "it": "Configurazione dell'interfaccia di amministrazione migliorata e risolti i problemi di adapter-check",
        "es": "Configuración de la interfaz de administración mejorada y problemas de verificación del adaptador corregidos",
        "pl": "Ulepszona konfiguracja interfejsu administratora i naprawione błędy adapter-check",
        "uk": "Покращена конфігурація інтерфейсу адміністратора та виправлені помилки adapter-check",
        "zh-cn": "改进了管理界面配置并修复了适配器检查问题"
      },
      "0.1.1": {
        "en": "Initial release",
        "de": "Erste Version",
        "ru": "Первая версия",
        "pt": "Versão inicial",
        "nl": "Eerste versie",
        "fr": "Première version",
        "it": "Prima versione",
        "es": "Primera versión",
        "pl": "Pierwsza wersja",
        "uk": "Перша версія",
        "zh-cn": "初始版本"
      }
    },
    "keywords": [
      "al-ko",
      "Robolinho",
      "mower",
      "garden",
      "smart-garden"
    ],
    "extIcon": "https://raw.githubusercontent.com/zechnerhubert/ioBroker.al-ko/main/admin/al-ko.png",
    "adminUI": {
      "config": "json"
    },
    "licenseInformation": {
      "type": "free",
      "license": "MIT",
      "link": "https://opensource.org/licenses/MIT"
    },
    "platform": "Javascript/Node.js",
    "type": "hardware",
    "loglevel": "info",
    "connectionType": "cloud",
    "dataSource": "push",
    "mode": "daemon",
    "compact": true,
    "icon": "al-ko.png",
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ]
  },
  "native": {
    "username": "",
    "password": "",
    "clientId": "",
    "clientSecret": "",
    "wsDebug": false
  },
  "protectedNative": [
    "password",
    "clientSecret"
  ],
  "encryptedNative": [
    "password",
    "clientSecret"
  ],
  "objects": [],
  "instanceObjects": []
}
