{
  "common": {
    "name": "al-ko",
    "version": "0.2.5",
    "tier": 3,
    "titleLang": {
      "en": "AL-KO",
      "de": "AL-KO",
      "ru": "AL-KO",
      "pt": "AL-KO",
      "nl": "AL-KO",
      "fr": "AL-KO",
      "it": "AL-KO",
      "es": "AL-KO",
      "pl": "AL-KO",
      "uk": "AL-KO",
      "zh-cn": "AL-KO"
    },
    "desc": {
      "en": "Adapter for AL-KO Robolinho lawnmowers",
      "de": "Adapter für AL-KO Robolinho Rasenmäher",
      "ru": "Адаптер для газонокосилок AL-KO Robolinho",
      "pt": "Adaptador para cortadores de grama AL-KO Robolinho",
      "nl": "Adapter voor AL-KO Robolinho grasmaaiers",
      "fr": "Adaptateur pour tondeuses AL-KO Robolinho",
      "it": "Adattatore per tosaerba AL-KO Robolinho",
      "es": "Adaptador para cortacéspedes AL-KO Robolinho",
      "pl": "Adapter do kosiarek AL-KO Robolinho",
      "uk": "Адаптер для газонокосарок AL-KO Robolinho",
      "zh-cn": "AL-KO Robolinho 割草机适配器"
    },
    "authors": [
      "Hubert Zechner <hubertiob@posteo.at>"
    ],
    "news": {
      "0.2.5": {
        "en": "Improved npm/Admin appearance: Added smaller external icon (128×128) and updated author format for better display. No functional changes.",
        "de": "Darstellung im npm/Admin-Bereich verbessert: Kleineres externes Icon (128×128) hinzugefügt und Autorenformat angepasst, um die Anzeige zu korrigieren. Keine funktionalen Änderungen."
      "0.2.4": {
        "en": "Metadata adjustments for correct npm/Admin display (author, icon). No functional changes.",
        "de": "Metadaten-Anpassungen für korrekte npm-/Admin-Anzeige (Autor, Icon). Keine funktionalen Änderungen.",
        "ru": "Корректировка метаданных для правильного отображения npm/Admin (автор, значок). Без функциональных изменений.",
        "pt": "Ajustes de metadados para exibição correta no npm/Admin (autor, ícone). Sem alterações funcionais.",
        "nl": "Metadata-aanpassingen voor juiste npm/Admin-weergave (auteur, pictogram). Geen functionele wijzigingen.",
        "fr": "Ajustements des métadonnées pour un affichage correct dans npm/Admin (auteur, icône). Aucune modification fonctionnelle.",
        "it": "Regolazioni dei metadati per la corretta visualizzazione su npm/Admin (autore, icona). Nessuna modifica funzionale.",
        "es": "Ajustes de metadatos para una visualización correcta en npm/Admin (autor, icono). Sin cambios funcionales.",
        "pl": "Dostosowanie metadanych do prawidłowego wyświetlania w npm/Admin (autor, ikona). Bez zmian funkcjonalnych.",
        "uk": "Коригування метаданих для правильного відображення в npm/Admin (автор, іконка). Без функціональних змін.",
        "zh-cn": "为确保在 npm/Admin 中正确显示（作者、图标）调整了元数据。无功能更改。"
      },
      "0.2.3": {
        "en": "Improved WebSocket stability: Added heartbeat (ping/pong) every 120 seconds with 30 seconds timeout. If no pong or an error occurs, the socket is closed and reconnected automatically. Removed the silence watchdog to avoid unnecessary reconnects during long idle phases (e.g., at night).",
        "de": "WebSocket-Stabilität verbessert: Heartbeat (Ping/Pong) alle 120 Sekunden mit 30 Sekunden Timeout hinzugefügt. Bei fehlendem Pong oder Fehlern wird die Verbindung geschlossen und automatisch neu verbunden. Der Silence-Watchdog wurde entfernt, um unnötige Reconnects während längerer Ruhephasen (z. B. nachts) zu vermeiden.",
        "ru": "Улучшена стабильность WebSocket: добавлен Heartbeat (ping/pong) каждые 120 секунд с тайм-аутом 30 секунд. При отсутствии pong или ошибках соединение закрывается и автоматически восстанавливается. Удалён watchdog тишины, чтобы избежать ненужных переподключений во время долгих периодов бездействия (например, ночью).",
        "pt": "Melhorada a estabilidade do WebSocket: Adicionado heartbeat (ping/pong) a cada 120 segundos com tempo limite de 30 segundos. Se não houver pong ou ocorrer um erro, o socket é fechado e reconectado automaticamente. Removido o watchdog de silêncio para evitar reconexões desnecessárias durante longos períodos de inatividade (por exemplo, à noite).",
        "nl": "Verbeterde WebSocket-stabiliteit: Heartbeat (ping/pong) toegevoegd elke 120 seconden met een timeout van 30 seconden. Als er geen pong of een fout optreedt, wordt de socket gesloten en automatisch opnieuw verbonden. De stilte-watchdog is verwijderd om onnodige reconnects tijdens langere inactieve periodes (bijv. 's nachts) te voorkomen.",
        "fr": "Stabilité WebSocket améliorée : ajout d'un heartbeat (ping/pong) toutes les 120 secondes avec un délai d'attente de 30 secondes. En cas d'absence de pong ou d'erreur, la connexion est fermée et reconnectée automatiquement. Le watchdog de silence a été supprimé afin d'éviter des reconnexions inutiles lors de longues périodes d'inactivité (par exemple, la nuit).",
        "it": "Migliorata la stabilità del WebSocket: aggiunto heartbeat (ping/pong) ogni 120 secondi con timeout di 30 secondi. Se manca il pong o si verifica un errore, la connessione viene chiusa e riconnessa automaticamente. Rimosso il watchdog del silenzio per evitare riconnessioni inutili durante lunghi periodi di inattività (ad esempio, di notte).",
        "es": "Mejorada la estabilidad del WebSocket: se añadió un heartbeat (ping/pong) cada 120 segundos con un tiempo de espera de 30 segundos. Si no hay pong o ocurre un error, el socket se cierra y se reconecta automáticamente. Se eliminó el watchdog de silencio para evitar reconexiones innecesarias durante largos períodos de inactividad (por ejemplo, por la noche).",
        "pl": "Poprawiona stabilność WebSocket: dodano heartbeat (ping/pong) co 120 sekund z limitem czasu 30 sekund. W przypadku braku pong lub błędu połączenie jest zamykane i automatycznie ponownie nawiązywane. Usunięto watchdog ciszy, aby uniknąć niepotrzebnych ponownych połączeń podczas długich okresów bezczynności (np. w nocy).",
        "uk": "Покращено стабільність WebSocket: додано heartbeat (ping/pong) кожні 120 секунд із тайм-аутом 30 секунд. Якщо pong не надходить або виникає помилка, з'єднання закривається та автоматично відновлюється. Видалено watchdog тиші, щоб уникнути непотрібних повторних підключень під час тривалих періодів бездіяльності (наприклад, уночі).",
        "zh-cn": "改进了 WebSocket 稳定性：每 120 秒添加一次心跳 (ping/pong)，超时 30 秒。如果没有收到 pong 或发生错误，连接将关闭并自动重新连接。移除了静默监视程序，以避免在长时间空闲期间（例如夜间）不必要的重新连接。"
      },
      "0.2.2": {
        "en": "Prepared for the first npm release. Synchronized versions between io-package.json and package.json. Added npm metadata and publication configuration. Minor internal adjustments for improved compatibility.",
        "de": "Für die erste npm-Veröffentlichung vorbereitet. Versionen zwischen io-package.json und package.json synchronisiert. npm-Metadaten und Veröffentlichungskonfiguration hinzugefügt. Kleine interne Anpassungen zur verbesserten Kompatibilität.",
        "ru": "Подготовлено к первому выпуску npm. Синхронизированы версии между io-package.json и package.json. Добавлены метаданные npm и конфигурация публикации. Небольшие внутренние улучшения для совместимости.",
        "pt": "Preparado para o primeiro lançamento no npm. Versões sincronizadas entre io-package.json e package.json. Metadados npm e configuração de publicação adicionados. Pequenos ajustes internos para compatibilidade aprimorada.",
        "nl": "Voorbereid op de eerste npm-release. Versies gesynchroniseerd tussen io-package.json en package.json. npm-metadata en publicatieconfiguratie toegevoegd. Kleine interne aanpassingen voor verbeterde compatibiliteit.",
        "fr": "Préparé pour la première publication npm. Versions synchronisées entre io-package.json et package.json. Ajout des métadonnées npm et de la configuration de publication. Petites améliorations internes pour une meilleure compatibilité.",
        "it": "Preparato per la prima pubblicazione npm. Versioni sincronizzate tra io-package.json e package.json. Aggiunti metadati npm e configurazione di pubblicazione. Piccoli miglioramenti interni per una migliore compatibilità.",
        "es": "Preparado para la primera publicación en npm. Versiones sincronizadas entre io-package.json y package.json. Se agregaron metadatos npm y configuración de publicación. Pequeñas mejoras internas para una mejor compatibilidad.",
        "pl": "Przygotowano do pierwszego wydania npm. Zsynchronizowano wersje między io-package.json i package.json. Dodano metadane npm i konfigurację publikacji. Drobne poprawki wewnętrzne dla lepszej kompatybilności.",
        "uk": "Підготовлено до першого випуску npm. Синхронізовано версії між io-package.json і package.json. Додано метадані npm та конфігурацію публікації. Невеликі внутрішні покращення для кращої сумісності.",
        "zh-cn": "为首次 npm 发布做好准备。同步 io-package.json 与 package.json 之间的版本。添加了 npm 元数据和发布配置。进行了少量内部改进以提高兼容性。"
      }
     },
    "keywords": [
      "al-ko",
      "Robolinho",
      "mower",
      "garden",
      "smart-garden"
    ],
    "extIcon": "https://raw.githubusercontent.com/zechnerhubert/ioBroker.al-ko/main/admin/al-ko-128.png",
    "adminUI": {
      "config": "json"
    },
    "licenseInformation": {
      "type": "free",
      "license": "MIT",
      "link": "https://opensource.org/licenses/MIT"
    },
    "platform": "Javascript/Node.js",
    "type": "hardware",
    "loglevel": "info",
    "connectionType": "cloud",
    "dataSource": "push",
    "mode": "daemon",
    "compact": true,
    "icon": "al-ko.png",
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ]
  },
  "native": {
    "username": "",
    "password": "",
    "clientId": "",
    "clientSecret": "",
    "wsDebug": false
  },
  "protectedNative": [
    "password",
    "clientSecret"
  ],
  "encryptedNative": [
    "password",
    "clientSecret"
  ],
  "objects": [],
  "instanceObjects": []
}
